f = """1. Алюминиевые балконные витражи холодные раздвижная система
2. Холодные алюминиевые балконные витражи с раздвижной системой
3. Алюминиевые балконные витражи раздвижные холодные
4. Алюминиевые балконные витражи раздвижная система холодная
5. Алюминиевые витражи внутренние
6. Витражи алюминиевые внутренние
7. Витражи алюминиевые для интерьера
8. Внутренние алюминиевые витражи
9. Алюминиевые витражи наружные с окнами
10. Алюминиевые витражи с окнами наружные
11. Витражи алюминиевые с окнами наружные
12. Наружные алюминиевые витражи с окнами
13. Алюминиевые витражи наружные, в составе витражей двери
14. Наружные алюминиевые витражи с дверями
15. Алюминиевые витражи с дверями в составе наружных витражей
16. Витражи алюминиевые наружные с дверями
17. Алюминиевые витражи со сдвижными дверьми
18. Витражи алюминиевые с дверями сдвижные
19. Алюминиевые витражи с сдвижными дверями
20. Витражи алюминиевые с дверьми сдвижной системой
21. Алюминиевые витражи тёплые
22. Тёплые алюминиевые витражи
23. Алюминиевые витражи для тёплого помещения
24. Тёплый алюминиевый витраж
25. Алюминиевые витражи холодные
26. Холодные алюминиевые витражи
27. Алюминиевые витражи для холодного помещения
28. Холодный алюминиевый витраж
29. Алюминиевые двери тёплые
30. Тёплые алюминиевые двери
31. Алюминиевые двери для тёплого помещения
32. Тёплая алюминиевая дверь
33. Алюминиевые двери холодные
34. Холодные алюминиевые двери
35. Алюминиевые двери для холодного помещения
36. Холодная алюминиевая дверь
37. Алюминиевые интегрированные ограждения
38. Интегрированные алюминиевые ограждения
39. Алюминиевые ограждения с интегрированными системами
40. Интегрированные ограждения из алюминия
41. Алюминиевые окна противопожарные
42. Противопожарные алюминиевые окна
43. Алюминиевые окна с противопожарной защитой
44. Окна алюминиевые противопожарные
45. Алюминиевые окна тёплые
46. Тёплые алюминиевые окна
47. Алюминиевые окна для тёплого помещения
48. Тёплое алюминиевое окно
49. Алюминиевые окна холодные
50. Холодные алюминиевые окна
51. Алюминиевые окна для холодного помещения
52. Холодное алюминиевое окно
53. Алюминиевые порталы
54. Алюминиевые порталные системы
55. Порталы алюминиевые
56. Системы алюминиевых порталов
57. Алюминиевые противопожарные конструкции
58. Противопожарные алюминиевые конструкции
59. Алюминиевые конструкции с противопожарной защитой
60. Конструкции алюминиевые противопожарные
61. Алюминиевые створки
62. Алюминиевые створки окон
63. Створки алюминиевые
64. Оконные алюминиевые створки
65. Алюминиевый витраж балконный
66. Балконный алюминиевый витраж
67. Алюминиевый балконный витраж
68. Витраж алюминиевый балконный
69. Интерьерные внутренние алюминиевые перегородки
70. Внутренние алюминиевые интерьерные перегородки
71. Алюминиевые перегородки внутренние для интерьера
72. Перегородки алюминиевые для интерьера
73. Интерьерные наружние алюминиевые перегородки
74. Алюминиевые перегородки наружные для интерьера
75. Наружные алюминиевые интерьерные перегородки
76. Перегородки алюминиевые наружные для интерьера
77. Монтаж алюминиевых конструкций
78. Монтаж алюминиевых систем
79. Сборка алюминиевых конструкций
80. Установка алюминиевых конструкций
81. Монтаж алюминиевых створок
82. Установка алюминиевых створок
83. Сборка алюминиевых створок
84. Монтаж алюминиевых оконных створок
85. Ригель под порог двери
86. Ригель для дверного порога
87. Ригель дверной под порог
88. Дверной ригель для порога
89. Светопрозрачные конструкции для "зимних садов"
90. Зимний сад светопрозрачные конструкции
91. Конструкции светопрозрачные для зимних садов
92. Светопрозрачные системы для зимних садов
93. Светопрозрачные конструкции из алюминиевого профиля (комплект на дом)
94. Алюминиевые светопрозрачные конструкции комплект для дома
95. Комплект алюминиевых светопрозрачных конструкций для дома
96. Алюминиевые светопрозрачные системы для дома
97. Балконные блоки из ПВХ профиля 58-60 мм белые
98. Белые балконные блоки из ПВХ профиля 58-60 мм
99. Балконные блоки ПВХ профиля 58-60 мм белого цвета
100. Белые балконные блоки ПВХ профиля 58-60 мм
101. Балконные блоки из ПВХ профиля 58-60 мм окрашенные
102. Окрашенные балконные блоки из ПВХ профиля 58-60 мм
103. Балконные блоки ПВХ профиля 58-60 мм с окраской
104. Окрашенные ПВХ балконные блоки 58-60 мм
105. Балконные блоки из ПВХ профиля 58-60 мм с ламинацией
106. Ламинированные балконные блоки из ПВХ профиля 58-60 мм
107. Балконные блоки из ПВХ профиля 58-60 мм с ламинированной поверхностью
108. Ламинированные ПВХ балконные блоки 58-60 мм
109. Балконные блоки из ПВХ профиля 70-71 мм белые
110. Белые балконные блоки ПВХ профиля 70-71 мм
111. Балконные блоки ПВХ профиля 70-71 мм белого цвета
112. Белые ПВХ балконные блоки 70-71 мм
113. Балконные блоки из ПВХ профиля 70-71 мм окрашенные
114. Окрашенные балконные блоки из ПВХ профиля 70-71 мм
115. Балконные блоки ПВХ профиля 70-71 мм с окраской
116. Окрашенные ПВХ балконные блоки 70-71 мм
117. Балконные блоки из ПВХ профиля 70-71 мм с ламинацией
118. Ламинированные балконные блоки из ПВХ профиля 70-71 мм
119. Балконные блоки ПВХ профиля 70-71 мм с ламинированной поверхностью
120. Ламинированные ПВХ балконные блоки 70-71 мм
121. Балконные блоки из ПВХ профиля 72-76 мм белые
122. Белые балконные блоки ПВХ профиля 72-76 мм
123. Балконные блоки ПВХ профиля 72-76 мм белого цвета
124. Белые ПВХ балконные блоки 72-76 мм
125. Балконные блоки из ПВХ профиля 72-76 мм окрашенные
126. Окрашенные балконные блоки из ПВХ профиля 72-76 мм
127. Балконные блоки ПВХ профиля 72-76 мм с окраской
128. Окрашенные ПВХ балконные блоки 72-76 мм
129. Балконные блоки из ПВХ профиля 72-76 мм с ламинацией
130. Ламинированные балконные блоки из ПВХ профиля 72-76 мм""".split('\n')
f2 = []

for i in f:
    print(i)
    f2.append(i.split('. ')[1])
import sys

# Открываем файл для записи
file = open("syntetics_door.txt", 'w', encoding='utf-8')

# Перенаправляем стандартный поток вывода (stdout) в файл
sys.stdout = file
s = set(f2)
print(len(s))
for i in s:
    print(i)
