tags_metadata = [
    {
        "name": "auth",
        "description": "Получение и обновление JWT токена",
    },
    {
        "name": "chat",
        "description": "Получение объекта чата для отображения всех сообщений",
    },
    {
        "name": "user",
        "description": "Создание нового пользователя, получение существующего пользователя для отображения "
                       "информации в личном кабинете",
    },
    {
        "name": "message",
        "description": "Создание сообщения, удаление всех сообщений [очиста чата], операции с избранными [favorite] сообщениями",
    },
    {
        "name": "tenant",
        "description": "Операции с тенантами. Тенант объединяет нескольких пользователей одной компании или одного отдела внутри компании."
                       "Ползователи внутри тенанта используют один промпт и одну базу загруженных документов",
    },
    {
        "name": "mark",
        "description": "Оценка сообщения [ответа ассистента]. Если оценка для сообщения уже проставлена,"
                       "то изменяется существующая запись",
    },
    {
        "name": "review",
        "description": "Отзыв на сообщение [ответ ассистента]. Удаление или изменение коммментария не предусмотрено",
    },
    {
        "name": "prediction",
        "description": "Получение ответа от ассистента по базам данных или по документам.",
    }
]
