UDS_LIST = [
    {
        "user_id": "15202",
        "name": "Едс Один",
        "address_list": [
            "Каширское шоссе, 65/1", "Каширское шоссе, 65/2", "Каширское шоссе, 65/3", "Каширское шоссе, 65/4",
            "Энтузиастов шоссе, 86А/1", "Энтузиастов шоссе, 86А/2", "Энтузиастов шоссе, 86А/3", "Ярцевская ул, 31",
            "Ярцевская ул, 34/2", "Багратионовский пр-д, 5А/1", "Багратионовский пр-д, 5А/1 (кв 1 - 258)",
            "Багратионовский пр-д, 5А/1 (кв 259 - 408)", "Багратионовский пр-д, 5А/1 (кв 409 - 1127)",
            "Краснобогатырская ул, 90/2", "Вавилова ул, 52/1", "Вильгельма Пика ул, 1"
        ]
    },
    {
        "user_id": "15203",
        "name": "Едс Два",
        "address_list": [
            "Волгоградский пр-кт, 32/3/1", "Волгоградский пр-кт, 32/3/2", "Волгоградский пр-кт, 32/3/3",
            "Волгоградский пр-кт, 32/3/4",
            "Волгоградский пр-кт, 32/3/5", "Волгоградский пр-кт, 32/3/6", "Волгоградский пр-кт, 32/3/7",
            "Волгоградский пр-кт, 32/3/8",
            "Волгоградский пр-кт, 32/5/1", "Волгоградский пр-кт, 32/5/2", "Волгоградский пр-кт, 32/5/3",
            "Новодмитровская ул, 2/1А",
            "Новодмитровская ул, 2/4", "Новодмитровская ул, 2/5", "Новодмитровская ул, 2/6", "Новодмитровская ул, 2/7",
            "Новодмитровская ул, 2/8", "Ильменский проезд, 14/1", "Ильменский проезд, 14/3", "Ильменский проезд, 14/6",
            "Ильменский проезд, 14/7", "Ильменский проезд, 14/8", "Днепропетровская ул, д. 25/1",
            "Днепропетровская ул, дом № 25, корпус 1"
        ]
    },
    {
        "user_id": "15204",
        "name": "Едс Три",
        "address_list": [
            "Дмитровский проезд, 1 АС", "Дмитровский проезд, 1 НП", "Дмитровский проезд, 1-1",
            "Дмитровский проезд, 1-2", "Дмитровский проезд, 1-3",
            "Головинское шоссе, 7", "Кронштадтский б-р, 6/1", "Кронштадтский б-р, 6/2", "Кронштадтский б-р, 6/3",
            "Кронштадтский б-р, 6/4",
            "Кронштадтский б-р, 6/5", "Кронштадтский б-р, 6 соор 6", "Андропова пр-кт, д. 9/1",
            "Ленинградский пр-кт, 35с2",
            "Береговой проезд, 5А", "Береговой проезд, 5А/2", "Береговой проезд, 5А/3", "Береговой проезд, 5А/4",
            "Береговой проезд, 5А/5",
            "Береговой проезд, 5А/6", "Береговой проезд, 5А/7", "Ленинградский пр-кт, 29/1",
            "Ленинградский пр-кт, 29/2",
            "Ленинградский пр-кт, 29/3", "Ленинградский пр-кт, 29/4", "Ленинградский пр-кт, 29/5"
        ]
    },
    {
        "user_id": "15481",
        "name": "Едс Четыре",
        "address_list": [
            "АФ Корабельная 1", "АФ Корабельная 11к1", "АФ Корабельная 13", "АФ Корабельная 15", "АФ Корабельная 17к1",
            "АФ Корабельная 17к2", "АФ Корабельная 17к3",
            "РПМ Коломенская 12к1", "РПМ Коломенская 12к2", "РПМ Коломенская 12к3", "РПМ Корабельная 11к2",
            "РПМ Корабельная 3А", "РПМ Корабельная 5а",
            "РПМ Корабельная 9А", "РПМ Корабельная, 9", "РПМ Паркинг Корабельная 6А",
            "РПМ Паркинг Корабельная 6А стр.1", "Академика Челомея, 1А",
            "Верхние Поля ул, 32/1", "Верхние Поля ул, 32/2", "Верхние Поля ул, 32/3", "Староалексеевская улица, 5А",
            "Фестивальная ул, 15к4", "Фестивальная ул, 15к5"
        ]
    }
]
